/* automatically generated by rust-bindgen 0.59.1 */

#![allow(dead_code, non_camel_case_types, non_upper_case_globals)]

use libc::size_t;

pub const RETRO_API_VERSION: u32 = 1;
pub const RETRO_DEVICE_TYPE_SHIFT: u32 = 8;
pub const RETRO_DEVICE_MASK: u32 = 255;
pub const RETRO_DEVICE_NONE: u32 = 0;
pub const RETRO_DEVICE_JOYPAD: u32 = 1;
pub const RETRO_DEVICE_MOUSE: u32 = 2;
pub const RETRO_DEVICE_KEYBOARD: u32 = 3;
pub const RETRO_DEVICE_LIGHTGUN: u32 = 4;
pub const RETRO_DEVICE_ANALOG: u32 = 5;
pub const RETRO_DEVICE_POINTER: u32 = 6;
pub const RETRO_DEVICE_ID_JOYPAD_B: u32 = 0;
pub const RETRO_DEVICE_ID_JOYPAD_Y: u32 = 1;
pub const RETRO_DEVICE_ID_JOYPAD_SELECT: u32 = 2;
pub const RETRO_DEVICE_ID_JOYPAD_START: u32 = 3;
pub const RETRO_DEVICE_ID_JOYPAD_UP: u32 = 4;
pub const RETRO_DEVICE_ID_JOYPAD_DOWN: u32 = 5;
pub const RETRO_DEVICE_ID_JOYPAD_LEFT: u32 = 6;
pub const RETRO_DEVICE_ID_JOYPAD_RIGHT: u32 = 7;
pub const RETRO_DEVICE_ID_JOYPAD_A: u32 = 8;
pub const RETRO_DEVICE_ID_JOYPAD_X: u32 = 9;
pub const RETRO_DEVICE_ID_JOYPAD_L: u32 = 10;
pub const RETRO_DEVICE_ID_JOYPAD_R: u32 = 11;
pub const RETRO_DEVICE_ID_JOYPAD_L2: u32 = 12;
pub const RETRO_DEVICE_ID_JOYPAD_R2: u32 = 13;
pub const RETRO_DEVICE_ID_JOYPAD_L3: u32 = 14;
pub const RETRO_DEVICE_ID_JOYPAD_R3: u32 = 15;
pub const RETRO_DEVICE_ID_JOYPAD_MASK: u32 = 256;
pub const RETRO_DEVICE_INDEX_ANALOG_LEFT: u32 = 0;
pub const RETRO_DEVICE_INDEX_ANALOG_RIGHT: u32 = 1;

        stream: *mut retro_vfs_file_handle,
        offset: i64,
        seek_position: ::std::os::raw::c_int,
    ) -> i64,
>;
pub type retro_vfs_read_t = ::std::option::Option<
    unsafe extern "C" fn(
        stream: *mut retro_vfs_file_handle,
        s: *mut ::std::os::raw::c_void,
        len: u64,
    ) -> i64,
>;
pub type retro_vfs_write_t = ::std::option::Option<
    unsafe extern "C" fn(
        stream: *mut retro_vfs_file_handle,
        s: *const ::std::os::raw::c_void,
        len: u64,
    ) -> i64,
>;
pub type retro_vfs_flush_t = ::std::option::Option<
    unsafe extern "C" fn(stream: *mut retro_vfs_file_handle) -> ::std::os::raw::c_int,
>;
pub type retro_vfs_remove_t = ::std::option::Option<
    unsafe extern "C" fn(path: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int,
>;
pub type retro_vfs_rename_t = ::std::option::Option<
    unsafe extern "C" fn(
        old_path: *const ::std::os::raw::c_char,
        new_path: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int,
>;
pub type retro_vfs_stat_t = ::std::option::Option<
    unsafe extern "C" fn(
        path: *const ::std::os::raw::c_char,
        size: *mut i32,
    ) -> ::std::os::raw::c_int,
>;
pub type retro_vfs_mkdir_t = ::std::option::Option<
    unsafe extern "C" fn(dir: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int,
>;
pub type retro_vfs_opendir_t = ::std::option::Option<
    unsafe extern "C" fn(
        dir: *const ::std::os::raw::c_char,
        include_hidden: bool,
    ) -> *mut retro_vfs_dir_handle,
>;
pub type retro_vfs_readdir_t =
    ::std::option::Option<unsafe extern "C" fn(dirstream: *mut retro_vfs_dir_handle) -> bool>;
pub type retro_vfs_dirent_get_name_t = ::std::option::Option<
    unsafe extern "C" fn(dirstream: *mut retro_vfs_dir_handle) -> *const ::std::os::raw::c_char,
>;
pub type retro_vfs_dirent_is_dir_t =
    ::std::option::Option<unsafe extern "C" fn(dirstream: *mut retro_vfs_dir_handle) -> bool>;
pub type retro_vfs_closedir_t = ::std::option::Option<
    unsafe extern "C" fn(dirstream: *mut retro_vfs_dir_handle) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_vfs_interface {
    pub get_path: retro_vfs_get_path_t,
    pub open: retro_vfs_open_t,
    pub close: retro_vfs_close_t,
    pub size: retro_vfs_size_t,
    pub tell: retro_vfs_tell_t,
    pub seek: retro_vfs_seek_t,
    pub read: retro_vfs_read_t,
    pub write: retro_vfs_write_t,
    pub flush: retro_vfs_flush_t,
    pub remove: retro_vfs_remove_t,
    pub rename: retro_vfs_rename_t,
    pub truncate: retro_vfs_truncate_t,
    pub stat: retro_vfs_stat_t,
    pub mkdir: retro_vfs_mkdir_t,
    pub opendir: retro_vfs_opendir_t,
    pub readdir: retro_vfs_readdir_t,
    pub dirent_get_name: retro_vfs_dirent_get_name_t,
    pub dirent_is_dir: retro_vfs_dirent_is_dir_t,
    pub closedir: retro_vfs_closedir_t,
}
#[test]
fn bindgen_test_layout_retro_vfs_interface() {
    assert_eq!(
        ::std::mem::size_of::<retro_vfs_interface>(),
        152usize,
        concat!("Size of: ", stringify!(retro_vfs_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_vfs_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_vfs_interface))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_vfs_interface>())).get_path as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_vfs_interface),
            "::",
            stringify!(get_path)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_vfs_interface>())).open as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_vfs_interface),
            "::",
            stringify!(open)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_vfs_interface>())).close as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_vfs_interface),
            "::",
            stringify!(close)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_vfs_interface>())).size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_vfs_interface),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_vfs_interface>())).tell as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_vfs_interface),
            "::",
            stringify!(tell)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_vfs_interface>())).seek as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_vfs_interface),
            "::",
            stringify!(seek)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_vfs_interface>())).read as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_vfs_interface),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_vfs_interface>())).write as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_vfs_interface),
            "::",
            stringify!(write)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_vfs_interface>())).flush as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_vfs_interface),
            "::",
            stringify!(flush)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_vfs_interface>())).remove as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_vfs_interface),
            "::",
            stringify!(remove)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_vfs_interface>())).rename as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_vfs_interface),
            "::",
            stringify!(rename)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_vfs_interface>())).truncate as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_vfs_interface),
            "::",
            stringify!(truncate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_vfs_interface>())).stat as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_vfs_interface),
            "::",
            stringify!(stat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_vfs_interface>())).mkdir as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_vfs_interface),
            "::",
            stringify!(mkdir)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_vfs_interface>())).opendir as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_vfs_interface),
            "::",
            stringify!(opendir)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_vfs_interface>())).readdir as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_vfs_interface),
            "::",
            stringify!(readdir)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_vfs_interface>())).dirent_get_name as *const _ as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_vfs_interface),
            "::",
            stringify!(dirent_get_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_vfs_interface>())).dirent_is_dir as *const _ as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_vfs_interface),
            "::",
            stringify!(dirent_is_dir)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_vfs_interface>())).closedir as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_vfs_interface),
            "::",
            stringify!(closedir)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_vfs_interface_info {
    pub required_interface_version: u32,
    pub iface: *mut retro_vfs_interface,
}
#[test]
fn bindgen_test_layout_retro_vfs_interface_info() {
    assert_eq!(
        ::std::mem::size_of::<retro_vfs_interface_info>(),
        16usize,
        concat!("Size of: ", stringify!(retro_vfs_interface_info))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_vfs_interface_info>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_vfs_interface_info))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_vfs_interface_info>())).required_interface_version
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_vfs_interface_info),
            "::",
            stringify!(required_interface_version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_vfs_interface_info>())).iface as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_vfs_interface_info),
            "::",
            stringify!(iface)
        )
    );
}
pub const retro_hw_render_interface_type_RETRO_HW_RENDER_INTERFACE_VULKAN:
    retro_hw_render_interface_type = 0;
pub const retro_hw_render_interface_type_RETRO_HW_RENDER_INTERFACE_D3D9:
    retro_hw_render_interface_type = 1;
pub const retro_hw_render_interface_type_RETRO_HW_RENDER_INTERFACE_D3D10:
    retro_hw_render_interface_type = 2;
pub const retro_hw_render_interface_type_RETRO_HW_RENDER_INTERFACE_D3D11:
    retro_hw_render_interface_type = 3;
pub const retro_hw_render_interface_type_RETRO_HW_RENDER_INTERFACE_D3D12:
    retro_hw_render_interface_type = 4;
pub const retro_hw_render_interface_type_RETRO_HW_RENDER_INTERFACE_GSKIT_PS2:
    retro_hw_render_interface_type = 5;
pub const retro_hw_render_interface_type_RETRO_HW_RENDER_INTERFACE_DUMMY:
    retro_hw_render_interface_type = 2147483647;
pub type retro_hw_render_interface_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_hw_render_interface {
    pub interface_type: retro_hw_render_interface_type,
    pub interface_version: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_retro_hw_render_interface() {
    assert_eq!(
        ::std::mem::size_of::<retro_hw_render_interface>(),
        8usize,
        concat!("Size of: ", stringify!(retro_hw_render_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_hw_render_interface>(),
        4usize,
        concat!("Alignment of ", stringify!(retro_hw_render_interface))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_hw_render_interface>())).interface_type as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_hw_render_interface),
            "::",
            stringify!(interface_type)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_hw_render_interface>())).interface_version as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_hw_render_interface),
            "::",
            stringify!(interface_version)
        )
    );
}
pub type retro_set_led_state_t = ::std::option::Option<
    unsafe extern "C" fn(led: ::std::os::raw::c_int, state: ::std::os::raw::c_int),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_led_interface {
    pub set_led_state: retro_set_led_state_t,
}
#[test]
fn bindgen_test_layout_retro_led_interface() {
    assert_eq!(
        ::std::mem::size_of::<retro_led_interface>(),
        8usize,
        concat!("Size of: ", stringify!(retro_led_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_led_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_led_interface))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_led_interface>())).set_led_state as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_led_interface),
            "::",
            stringify!(set_led_state)
        )
    );
}
pub type retro_midi_input_enabled_t = ::std::option::Option<unsafe extern "C" fn() -> bool>;
pub type retro_midi_output_enabled_t = ::std::option::Option<unsafe extern "C" fn() -> bool>;
pub type retro_midi_read_t = ::std::option::Option<unsafe extern "C" fn(byte: *mut u8) -> bool>;
pub type retro_midi_write_t =
    ::std::option::Option<unsafe extern "C" fn(byte: u8, delta_time: u32) -> bool>;
pub type retro_midi_flush_t = ::std::option::Option<unsafe extern "C" fn() -> bool>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_midi_interface {
    pub input_enabled: retro_midi_input_enabled_t,
    pub output_enabled: retro_midi_output_enabled_t,
    pub read: retro_midi_read_t,
    pub write: retro_midi_write_t,
    pub flush: retro_midi_flush_t,
}
#[test]
fn bindgen_test_layout_retro_midi_interface() {
    assert_eq!(
        ::std::mem::size_of::<retro_midi_interface>(),
        40usize,
        concat!("Size of: ", stringify!(retro_midi_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_midi_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_midi_interface))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_midi_interface>())).input_enabled as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_midi_interface),
            "::",
            stringify!(input_enabled)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_midi_interface>())).output_enabled as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_midi_interface),
            "::",
            stringify!(output_enabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_midi_interface>())).read as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_midi_interface),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_midi_interface>())).write as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_midi_interface),
            "::",
            stringify!(write)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_midi_interface>())).flush as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_midi_interface),
            "::",
            stringify!(flush)
        )
    );
}
pub const retro_hw_render_context_negotiation_interface_type_RETRO_HW_RENDER_CONTEXT_NEGOTIATION_INTERFACE_VULKAN : retro_hw_render_context_negotiation_interface_type = 0 ;
pub const retro_hw_render_context_negotiation_interface_type_RETRO_HW_RENDER_CONTEXT_NEGOTIATION_INTERFACE_DUMMY : retro_hw_render_context_negotiation_interface_type = 2147483647 ;
pub type retro_hw_render_context_negotiation_interface_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_hw_render_context_negotiation_interface {
    pub interface_type: retro_hw_render_context_negotiation_interface_type,
    pub interface_version: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_retro_hw_render_context_negotiation_interface() {
    assert_eq!(
        ::std::mem::size_of::<retro_hw_render_context_negotiation_interface>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(retro_hw_render_context_negotiation_interface)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<retro_hw_render_context_negotiation_interface>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(retro_hw_render_context_negotiation_interface)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_hw_render_context_negotiation_interface>())).interface_type
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_hw_render_context_negotiation_interface),
            "::",
            stringify!(interface_type)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_hw_render_context_negotiation_interface>()))
                .interface_version as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_hw_render_context_negotiation_interface),
            "::",
            stringify!(interface_version)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_memory_descriptor {
    pub flags: u64,
    pub ptr: *mut ::std::os::raw::c_void,
    pub offset: size_t,
    pub start: size_t,
    pub select: size_t,
    pub disconnect: size_t,
    pub len: size_t,
    pub addrspace: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_retro_memory_descriptor() {
    assert_eq!(
        ::std::mem::size_of::<retro_memory_descriptor>(),
        64usize,
        concat!("Size of: ", stringify!(retro_memory_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_memory_descriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_memory_descriptor))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_memory_descriptor>())).flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_memory_descriptor),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_memory_descriptor>())).ptr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_memory_descriptor),
            "::",
            stringify!(ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_memory_descriptor>())).offset as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_memory_descriptor),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_memory_descriptor>())).start as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_memory_descriptor),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_memory_descriptor>())).select as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_memory_descriptor),
            "::",
            stringify!(select)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_memory_descriptor>())).disconnect as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_memory_descriptor),
            "::",
            stringify!(disconnect)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_memory_descriptor>())).len as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_memory_descriptor),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_memory_descriptor>())).addrspace as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_memory_descriptor),
            "::",
            stringify!(addrspace)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_memory_map {
    pub descriptors: *const retro_memory_descriptor,
    pub num_descriptors: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_retro_memory_map() {
    assert_eq!(
        ::std::mem::size_of::<retro_memory_map>(),
        16usize,
        concat!("Size of: ", stringify!(retro_memory_map))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_memory_map>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_memory_map))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_memory_map>())).descriptors as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_memory_map),
            "::",
            stringify!(descriptors)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_memory_map>())).num_descriptors as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_memory_map),
            "::",
            stringify!(num_descriptors)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_controller_description {
    pub desc: *const ::std::os::raw::c_char,
    pub id: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_retro_controller_description() {
    assert_eq!(
        ::std::mem::size_of::<retro_controller_description>(),
        16usize,
        concat!("Size of: ", stringify!(retro_controller_description))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_controller_description>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_controller_description))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_controller_description>())).desc as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_controller_description),
            "::",
            stringify!(desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_controller_description>())).id as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_controller_description),
            "::",
            stringify!(id)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_controller_info {
    pub types: *const retro_controller_description,
    pub num_types: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_retro_controller_info() {
    assert_eq!(
        ::std::mem::size_of::<retro_controller_info>(),
        16usize,
        concat!("Size of: ", stringify!(retro_controller_info))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_controller_info>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_controller_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_controller_info>())).types as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_controller_info),
            "::",
            stringify!(types)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_controller_info>())).num_types as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_controller_info),
            "::",
            stringify!(num_types)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_subsystem_memory_info {
    pub extension: *const ::std::os::raw::c_char,
    pub type_: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_retro_subsystem_memory_info() {
    assert_eq!(
        ::std::mem::size_of::<retro_subsystem_memory_info>(),
        16usize,
        concat!("Size of: ", stringify!(retro_subsystem_memory_info))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_subsystem_memory_info>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_subsystem_memory_info))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_subsystem_memory_info>())).extension as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_subsystem_memory_info),
            "::",
            stringify!(extension)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_subsystem_memory_info>())).type_ as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_subsystem_memory_info),
            "::",
            stringify!(type_)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_subsystem_rom_info {
    pub desc: *const ::std::os::raw::c_char,
    pub valid_extensions: *const ::std::os::raw::c_char,
    pub need_fullpath: bool,
    pub block_extract: bool,
    pub required: bool,
    pub memory: *const retro_subsystem_memory_info,
    pub num_memory: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_retro_subsystem_rom_info() {
    assert_eq!(
        ::std::mem::size_of::<retro_subsystem_rom_info>(),
        40usize,
        concat!("Size of: ", stringify!(retro_subsystem_rom_info))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_subsystem_rom_info>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_subsystem_rom_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_subsystem_rom_info>())).desc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_subsystem_rom_info),
            "::",
            stringify!(desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_subsystem_rom_info>())).valid_extensions as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_subsystem_rom_info),
            "::",
            stringify!(valid_extensions)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_subsystem_rom_info>())).need_fullpath as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_subsystem_rom_info),
            "::",
            stringify!(need_fullpath)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_subsystem_rom_info>())).block_extract as *const _ as usize
        },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_subsystem_rom_info),
            "::",
            stringify!(block_extract)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_subsystem_rom_info>())).required as *const _ as usize
        },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_subsystem_rom_info),
            "::",
            stringify!(required)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_subsystem_rom_info>())).memory as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_subsystem_rom_info),
            "::",
            stringify!(memory)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_subsystem_rom_info>())).num_memory as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_subsystem_rom_info),
            "::",
            stringify!(num_memory)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_subsystem_info {
    pub desc: *const ::std::os::raw::c_char,
    pub ident: *const ::std::os::raw::c_char,
    pub roms: *const retro_subsystem_rom_info,
    pub num_roms: ::std::os::raw::c_uint,
    pub id: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_retro_subsystem_info() {
    assert_eq!(
        ::std::mem::size_of::<retro_subsystem_info>(),
        32usize,
        concat!("Size of: ", stringify!(retro_subsystem_info))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_subsystem_info>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_subsystem_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_subsystem_info>())).desc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_subsystem_info),
            "::",
            stringify!(desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_subsystem_info>())).ident as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_subsystem_info),
            "::",
            stringify!(ident)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_subsystem_info>())).roms as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_subsystem_info),
            "::",
            stringify!(roms)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_subsystem_info>())).num_roms as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_subsystem_info),
            "::",
            stringify!(num_roms)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_subsystem_info>())).id as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_subsystem_info),
            "::",
            stringify!(id)
        )
    );
}
pub type retro_proc_address_t = ::std::option::Option<unsafe extern "C" fn()>;
pub type retro_get_proc_address_t = ::std::option::Option<
    unsafe extern "C" fn(sym: *const ::std::os::raw::c_char) -> retro_proc_address_t,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_get_proc_address_interface {
    pub get_proc_address: retro_get_proc_address_t,
}
#[test]
fn bindgen_test_layout_retro_get_proc_address_interface() {
    assert_eq!(
        ::std::mem::size_of::<retro_get_proc_address_interface>(),
        8usize,
        concat!("Size of: ", stringify!(retro_get_proc_address_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_get_proc_address_interface>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(retro_get_proc_address_interface)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_get_proc_address_interface>())).get_proc_address
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_get_proc_address_interface),
            "::",
            stringify!(get_proc_address)
        )
    );
}
pub const retro_log_level_RETRO_LOG_DEBUG: retro_log_level = 0;
pub const retro_log_level_RETRO_LOG_INFO: retro_log_level = 1;
pub const retro_log_level_RETRO_LOG_WARN: retro_log_level = 2;
pub const retro_log_level_RETRO_LOG_ERROR: retro_log_level = 3;
pub const retro_log_level_RETRO_LOG_DUMMY: retro_log_level = 2147483647;
pub type retro_log_level = ::std::os::raw::c_uint;
pub type retro_log_printf_t = ::std::option::Option<
    unsafe extern "C" fn(level: retro_log_level, fmt: *const ::std::os::raw::c_char, ...),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_log_callback {
    pub log: retro_log_printf_t,
}
#[test]
fn bindgen_test_layout_retro_log_callback() {
    assert_eq!(
        ::std::mem::size_of::<retro_log_callback>(),
        8usize,
        concat!("Size of: ", stringify!(retro_log_callback))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_log_callback>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_log_callback))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_log_callback>())).log as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_log_callback),
            "::",
            stringify!(log)
        )
    );
}
pub type retro_perf_tick_t = u64;
pub type retro_time_t = i64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_perf_counter {
    pub ident: *const ::std::os::raw::c_char,
    pub start: retro_perf_tick_t,
    pub total: retro_perf_tick_t,
    pub call_cnt: retro_perf_tick_t,
    pub registered: bool,
}
#[test]
fn bindgen_test_layout_retro_perf_counter() {
    assert_eq!(
        ::std::mem::size_of::<retro_perf_counter>(),
        40usize,
        concat!("Size of: ", stringify!(retro_perf_counter))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_perf_counter>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_perf_counter))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_perf_counter>())).ident as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_perf_counter),
            "::",
            stringify!(ident)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_perf_counter>())).start as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_perf_counter),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_perf_counter>())).total as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_perf_counter),
            "::",
            stringify!(total)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_perf_counter>())).call_cnt as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_perf_counter),
            "::",
            stringify!(call_cnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_perf_counter>())).registered as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_perf_counter),
            "::",
            stringify!(registered)
        )
    );
}
pub type retro_perf_get_time_usec_t = ::std::option::Option<unsafe extern "C" fn() -> retro_time_t>;
pub type retro_perf_get_counter_t =
    ::std::option::Option<unsafe extern "C" fn() -> retro_perf_tick_t>;
pub type retro_get_cpu_features_t = ::std::option::Option<unsafe extern "C" fn() -> u64>;
pub type retro_perf_log_t = ::std::option::Option<unsafe extern "C" fn()>;
pub type retro_perf_register_t =
    ::std::option::Option<unsafe extern "C" fn(counter: *mut retro_perf_counter)>;
pub type retro_perf_start_t =
    ::std::option::Option<unsafe extern "C" fn(counter: *mut retro_perf_counter)>;
pub type retro_perf_stop_t =
    ::std::option::Option<unsafe extern "C" fn(counter: *mut retro_perf_counter)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_perf_callback {
    pub get_time_usec: retro_perf_get_time_usec_t,
    pub get_cpu_features: retro_get_cpu_features_t,
    pub get_perf_counter: retro_perf_get_counter_t,
    pub perf_register: retro_perf_register_t,
    pub perf_start: retro_perf_start_t,
    pub perf_stop: retro_perf_stop_t,
    pub perf_log: retro_perf_log_t,
}
#[test]
fn bindgen_test_layout_retro_perf_callback() {
    assert_eq!(
        ::std::mem::size_of::<retro_perf_callback>(),
        56usize,
        concat!("Size of: ", stringify!(retro_perf_callback))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_perf_callback>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_perf_callback))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_perf_callback>())).get_time_usec as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_perf_callback),
            "::",
            stringify!(get_time_usec)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_perf_callback>())).get_cpu_features as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_perf_callback),
            "::",
            stringify!(get_cpu_features)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_perf_callback>())).get_perf_counter as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_perf_callback),
            "::",
            stringify!(get_perf_counter)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_perf_callback>())).perf_register as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_perf_callback),
            "::",
            stringify!(perf_register)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_perf_callback>())).perf_start as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_perf_callback),
            "::",
            stringify!(perf_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_perf_callback>())).perf_stop as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_perf_callback),
            "::",
            stringify!(perf_stop)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_perf_callback>())).perf_log as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_perf_callback),
            "::",
            stringify!(perf_log)
        )
    );
}
pub const retro_sensor_action_RETRO_SENSOR_ACCELEROMETER_ENABLE: retro_sensor_action = 0;
pub const retro_sensor_action_RETRO_SENSOR_ACCELEROMETER_DISABLE: retro_sensor_action = 1;
pub const retro_sensor_action_RETRO_SENSOR_GYROSCOPE_ENABLE: retro_sensor_action = 2;
pub const retro_sensor_action_RETRO_SENSOR_GYROSCOPE_DISABLE: retro_sensor_action = 3;
pub const retro_sensor_action_RETRO_SENSOR_ILLUMINANCE_ENABLE: retro_sensor_action = 4;
pub const retro_sensor_action_RETRO_SENSOR_ILLUMINANCE_DISABLE: retro_sensor_action = 5;
pub const retro_sensor_action_RETRO_SENSOR_DUMMY: retro_sensor_action = 2147483647;
pub type retro_sensor_action = ::std::os::raw::c_uint;
pub type retro_set_sensor_state_t = ::std::option::Option<
    unsafe extern "C" fn(
        port: ::std::os::raw::c_uint,
        action: retro_sensor_action,
        rate: ::std::os::raw::c_uint,
    ) -> bool,
>;
pub type retro_sensor_get_input_t = ::std::option::Option<
    unsafe extern "C" fn(port: ::std::os::raw::c_uint, id: ::std::os::raw::c_uint) -> f32,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_sensor_interface {
    pub set_sensor_state: retro_set_sensor_state_t,
    pub get_sensor_input: retro_sensor_get_input_t,
}
#[test]
fn bindgen_test_layout_retro_sensor_interface() {
    assert_eq!(
        ::std::mem::size_of::<retro_sensor_interface>(),
        16usize,
        concat!("Size of: ", stringify!(retro_sensor_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_sensor_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_sensor_interface))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_sensor_interface>())).set_sensor_state as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_sensor_interface),
            "::",
            stringify!(set_sensor_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_sensor_interface>())).get_sensor_input as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_sensor_interface),
            "::",
            stringify!(get_sensor_input)
        )
    );
}
pub const retro_camera_buffer_RETRO_CAMERA_BUFFER_OPENGL_TEXTURE: retro_camera_buffer = 0;
pub const retro_camera_buffer_RETRO_CAMERA_BUFFER_RAW_FRAMEBUFFER: retro_camera_buffer = 1;
pub const retro_camera_buffer_RETRO_CAMERA_BUFFER_DUMMY: retro_camera_buffer = 2147483647;
pub type retro_camera_buffer = ::std::os::raw::c_uint;
pub type retro_camera_start_t = ::std::option::Option<unsafe extern "C" fn() -> bool>;
pub type retro_camera_stop_t = ::std::option::Option<unsafe extern "C" fn()>;
pub type retro_camera_lifetime_status_t = ::std::option::Option<unsafe extern "C" fn()>;
pub type retro_camera_frame_raw_framebuffer_t = ::std::option::Option<
    unsafe extern "C" fn(
        buffer: *const u32,
        width: ::std::os::raw::c_uint,
        height: ::std::os::raw::c_uint,
        pitch: size_t,
    ),
>;
pub type retro_camera_frame_opengl_texture_t = ::std::option::Option<
    unsafe extern "C" fn(
        texture_id: ::std::os::raw::c_uint,
        texture_target: ::std::os::raw::c_uint,
        affine: *const f32,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_camera_callback {
    pub caps: u64,
    pub width: ::std::os::raw::c_uint,
    pub height: ::std::os::raw::c_uint,
    pub start: retro_camera_start_t,
    pub stop: retro_camera_stop_t,
    pub frame_raw_framebuffer: retro_camera_frame_raw_framebuffer_t,
    pub frame_opengl_texture: retro_camera_frame_opengl_texture_t,
    pub initialized: retro_camera_lifetime_status_t,
    pub deinitialized: retro_camera_lifetime_status_t,
}
#[test]
fn bindgen_test_layout_retro_camera_callback() {
    assert_eq!(
        ::std::mem::size_of::<retro_camera_callback>(),
        64usize,
        concat!("Size of: ", stringify!(retro_camera_callback))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_camera_callback>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_camera_callback))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_camera_callback>())).caps as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_camera_callback),
            "::",
            stringify!(caps)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_camera_callback>())).width as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_camera_callback),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_camera_callback>())).height as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_camera_callback),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_camera_callback>())).start as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_camera_callback),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_camera_callback>())).stop as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_camera_callback),
            "::",
            stringify!(stop)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_camera_callback>())).frame_raw_framebuffer as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_camera_callback),
            "::",
            stringify!(frame_raw_framebuffer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_camera_callback>())).frame_opengl_texture as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_camera_callback),
            "::",
            stringify!(frame_opengl_texture)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_camera_callback>())).initialized as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_camera_callback),
            "::",
            stringify!(initialized)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_camera_callback>())).deinitialized as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_camera_callback),
            "::",
            stringify!(deinitialized)
        )
    );
}
pub type retro_location_set_interval_t = ::std::option::Option<
    unsafe extern "C" fn(
        interval_ms: ::std::os::raw::c_uint,
        interval_distance: ::std::os::raw::c_uint,
    ),
>;
pub type retro_location_start_t = ::std::option::Option<unsafe extern "C" fn() -> bool>;
pub type retro_location_stop_t = ::std::option::Option<unsafe extern "C" fn()>;
pub type retro_location_get_position_t = ::std::option::Option<
    unsafe extern "C" fn(
        lat: *mut f64,
        lon: *mut f64,
        horiz_accuracy: *mut f64,
        vert_accuracy: *mut f64,
    ) -> bool,
>;
pub type retro_location_lifetime_status_t = ::std::option::Option<unsafe extern "C" fn()>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_location_callback {
    pub start: retro_location_start_t,
    pub stop: retro_location_stop_t,
    pub get_position: retro_location_get_position_t,
    pub set_interval: retro_location_set_interval_t,
    pub initialized: retro_location_lifetime_status_t,
    pub deinitialized: retro_location_lifetime_status_t,
}
#[test]
fn bindgen_test_layout_retro_location_callback() {
    assert_eq!(
        ::std::mem::size_of::<retro_location_callback>(),
        48usize,
        concat!("Size of: ", stringify!(retro_location_callback))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_location_callback>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_location_callback))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_location_callback>())).start as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_location_callback),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_location_callback>())).stop as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_location_callback),
            "::",
            stringify!(stop)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_location_callback>())).get_position as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_location_callback),
            "::",
            stringify!(get_position)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_location_callback>())).set_interval as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_location_callback),
            "::",
            stringify!(set_interval)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_location_callback>())).initialized as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_location_callback),
            "::",
            stringify!(initialized)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_location_callback>())).deinitialized as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_location_callback),
            "::",
            stringify!(deinitialized)
        )
    );
}
pub const retro_rumble_effect_RETRO_RUMBLE_STRONG: retro_rumble_effect = 0;
pub const retro_rumble_effect_RETRO_RUMBLE_WEAK: retro_rumble_effect = 1;
pub const retro_rumble_effect_RETRO_RUMBLE_DUMMY: retro_rumble_effect = 2147483647;
pub type retro_rumble_effect = ::std::os::raw::c_uint;
pub type retro_set_rumble_state_t = ::std::option::Option<
    unsafe extern "C" fn(
        port: ::std::os::raw::c_uint,
        effect: retro_rumble_effect,
        strength: u16,
    ) -> bool,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_rumble_interface {
    pub set_rumble_state: retro_set_rumble_state_t,
}
#[test]
fn bindgen_test_layout_retro_rumble_interface() {
    assert_eq!(
        ::std::mem::size_of::<retro_rumble_interface>(),
        8usize,
        concat!("Size of: ", stringify!(retro_rumble_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_rumble_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_rumble_interface))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_rumble_interface>())).set_rumble_state as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_rumble_interface),
            "::",
            stringify!(set_rumble_state)
        )
    );
}
pub type retro_audio_callback_t = ::std::option::Option<unsafe extern "C" fn()>;
pub type retro_audio_set_state_callback_t =
    ::std::option::Option<unsafe extern "C" fn(enabled: bool)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_audio_callback {
    pub callback: retro_audio_callback_t,
    pub set_state: retro_audio_set_state_callback_t,
}
#[test]
fn bindgen_test_layout_retro_audio_callback() {
    assert_eq!(
        ::std::mem::size_of::<retro_audio_callback>(),
        16usize,
        concat!("Size of: ", stringify!(retro_audio_callback))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_audio_callback>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_audio_callback))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_audio_callback>())).callback as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_audio_callback),
            "::",
            stringify!(callback)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_audio_callback>())).set_state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_audio_callback),
            "::",
            stringify!(set_state)
        )
    );
}
pub type retro_usec_t = i64;
pub type retro_frame_time_callback_t =
    ::std::option::Option<unsafe extern "C" fn(usec: retro_usec_t)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_frame_time_callback {
    pub callback: retro_frame_time_callback_t,
    pub reference: retro_usec_t,
}
#[test]
fn bindgen_test_layout_retro_frame_time_callback() {
    assert_eq!(
        ::std::mem::size_of::<retro_frame_time_callback>(),
        16usize,
        concat!("Size of: ", stringify!(retro_frame_time_callback))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_frame_time_callback>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_frame_time_callback))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_frame_time_callback>())).callback as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_frame_time_callback),
            "::",
            stringify!(callback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_frame_time_callback>())).reference as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_frame_time_callback),
            "::",
            stringify!(reference)
        )
    );
}
pub type retro_audio_buffer_status_callback_t = ::std::option::Option<
    unsafe extern "C" fn(active: bool, occupancy: ::std::os::raw::c_uint, underrun_likely: bool),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_audio_buffer_status_callback {
    pub callback: retro_audio_buffer_status_callback_t,
}
#[test]
fn bindgen_test_layout_retro_audio_buffer_status_callback() {
    assert_eq!(
        ::std::mem::size_of::<retro_audio_buffer_status_callback>(),
        8usize,
        concat!("Size of: ", stringify!(retro_audio_buffer_status_callback))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_audio_buffer_status_callback>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(retro_audio_buffer_status_callback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_audio_buffer_status_callback>())).callback as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_audio_buffer_status_callback),
            "::",
            stringify!(callback)
        )
    );
}
pub type retro_hw_context_reset_t = ::std::option::Option<unsafe extern "C" fn()>;
pub type retro_hw_get_current_framebuffer_t =
    ::std::option::Option<unsafe extern "C" fn() -> usize>;
pub type retro_hw_get_proc_address_t = ::std::option::Option<
    unsafe extern "C" fn(sym: *const ::std::os::raw::c_char) -> retro_proc_address_t,
>;
pub const retro_hw_context_type_RETRO_HW_CONTEXT_NONE: retro_hw_context_type = 0;
pub const retro_hw_context_type_RETRO_HW_CONTEXT_OPENGL: retro_hw_context_type = 1;
pub const retro_hw_context_type_RETRO_HW_CONTEXT_OPENGLES2: retro_hw_context_type = 2;
pub const retro_hw_context_type_RETRO_HW_CONTEXT_OPENGL_CORE: retro_hw_context_type = 3;
pub const retro_hw_context_type_RETRO_HW_CONTEXT_OPENGLES3: retro_hw_context_type = 4;
pub const retro_hw_context_type_RETRO_HW_CONTEXT_OPENGLES_VERSION: retro_hw_context_type = 5;
pub const retro_hw_context_type_RETRO_HW_CONTEXT_VULKAN: retro_hw_context_type = 6;
pub const retro_hw_context_type_RETRO_HW_CONTEXT_DIRECT3D: retro_hw_context_type = 7;
pub const retro_hw_context_type_RETRO_HW_CONTEXT_DUMMY: retro_hw_context_type = 2147483647;
pub type retro_hw_context_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_hw_render_callback {
    pub context_type: retro_hw_context_type,
    pub context_reset: retro_hw_context_reset_t,
    pub get_current_framebuffer: retro_hw_get_current_framebuffer_t,
    pub get_proc_address: retro_hw_get_proc_address_t,
    pub depth: bool,
    pub stencil: bool,
    pub bottom_left_origin: bool,
    pub version_major: ::std::os::raw::c_uint,
    pub version_minor: ::std::os::raw::c_uint,
    pub cache_context: bool,
    pub context_destroy: retro_hw_context_reset_t,
    pub debug_context: bool,
}
#[test]
fn bindgen_test_layout_retro_hw_render_callback() {
    assert_eq!(
        ::std::mem::size_of::<retro_hw_render_callback>(),
        64usize,
        concat!("Size of: ", stringify!(retro_hw_render_callback))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_hw_render_callback>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_hw_render_callback))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_hw_render_callback>())).context_type as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_hw_render_callback),
            "::",
            stringify!(context_type)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_hw_render_callback>())).context_reset as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_hw_render_callback),
            "::",
            stringify!(context_reset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_hw_render_callback>())).get_current_framebuffer as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_hw_render_callback),
            "::",
            stringify!(get_current_framebuffer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_hw_render_callback>())).get_proc_address as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_hw_render_callback),
            "::",
            stringify!(get_proc_address)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_hw_render_callback>())).depth as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_hw_render_callback),
            "::",
            stringify!(depth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_hw_render_callback>())).stencil as *const _ as usize
        },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_hw_render_callback),
            "::",
            stringify!(stencil)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_hw_render_callback>())).bottom_left_origin as *const _
                as usize
        },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_hw_render_callback),
            "::",
            stringify!(bottom_left_origin)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_hw_render_callback>())).version_major as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_hw_render_callback),
            "::",
            stringify!(version_major)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_hw_render_callback>())).version_minor as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_hw_render_callback),
            "::",
            stringify!(version_minor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_hw_render_callback>())).cache_context as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_hw_render_callback),
            "::",
            stringify!(cache_context)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_hw_render_callback>())).context_destroy as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_hw_render_callback),
            "::",
            stringify!(context_destroy)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_hw_render_callback>())).debug_context as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_hw_render_callback),
            "::",
            stringify!(debug_context)
        )
    );
}
pub type retro_keyboard_event_t = ::std::option::Option<
    unsafe extern "C" fn(
        down: bool,
        keycode: ::std::os::raw::c_uint,
        character: u32,
        key_modifiers: u16,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_keyboard_callback {
    pub callback: retro_keyboard_event_t,
}
#[test]
fn bindgen_test_layout_retro_keyboard_callback() {
    assert_eq!(
        ::std::mem::size_of::<retro_keyboard_callback>(),
        8usize,
        concat!("Size of: ", stringify!(retro_keyboard_callback))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_keyboard_callback>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_keyboard_callback))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_keyboard_callback>())).callback as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_keyboard_callback),
            "::",
            stringify!(callback)
        )
    );
}
pub type retro_set_eject_state_t =
    ::std::option::Option<unsafe extern "C" fn(ejected: bool) -> bool>;
pub type retro_get_eject_state_t = ::std::option::Option<unsafe extern "C" fn() -> bool>;
pub type retro_get_image_index_t =
    ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_uint>;
pub type retro_set_image_index_t =
    ::std::option::Option<unsafe extern "C" fn(index: ::std::os::raw::c_uint) -> bool>;
pub type retro_get_num_images_t =
    ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_uint>;
pub type retro_replace_image_index_t = ::std::option::Option<
    unsafe extern "C" fn(index: ::std::os::raw::c_uint, info: *const retro_game_info) -> bool,
>;
pub type retro_add_image_index_t = ::std::option::Option<unsafe extern "C" fn() -> bool>;
pub type retro_set_initial_image_t = ::std::option::Option<
    unsafe extern "C" fn(
        index: ::std::os::raw::c_uint,
        path: *const ::std::os::raw::c_char,
    ) -> bool,
>;
pub type retro_get_image_path_t = ::std::option::Option<
    unsafe extern "C" fn(
        index: ::std::os::raw::c_uint,
        path: *mut ::std::os::raw::c_char,
        len: size_t,
    ) -> bool,
>;
pub type retro_get_image_label_t = ::std::option::Option<
    unsafe extern "C" fn(
        index: ::std::os::raw::c_uint,
        label: *mut ::std::os::raw::c_char,
        len: size_t,
    ) -> bool,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_disk_control_callback {
    pub set_eject_state: retro_set_eject_state_t,
    pub get_eject_state: retro_get_eject_state_t,
    pub get_image_index: retro_get_image_index_t,
    pub set_image_index: retro_set_image_index_t,
    pub get_num_images: retro_get_num_images_t,
    pub replace_image_index: retro_replace_image_index_t,
    pub add_image_index: retro_add_image_index_t,
}
#[test]
fn bindgen_test_layout_retro_disk_control_callback() {
    assert_eq!(
        ::std::mem::size_of::<retro_disk_control_callback>(),
        56usize,
        concat!("Size of: ", stringify!(retro_disk_control_callback))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_disk_control_callback>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_disk_control_callback))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_disk_control_callback>())).set_eject_state as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_disk_control_callback),
            "::",
            stringify!(set_eject_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_disk_control_callback>())).get_eject_state as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_disk_control_callback),
            "::",
            stringify!(get_eject_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_disk_control_callback>())).get_image_index as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_disk_control_callback),
            "::",
            stringify!(get_image_index)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_disk_control_callback>())).set_image_index as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_disk_control_callback),
            "::",
            stringify!(set_image_index)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_disk_control_callback>())).get_num_images as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_disk_control_callback),
            "::",
            stringify!(get_num_images)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_disk_control_callback>())).replace_image_index as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_disk_control_callback),
            "::",
            stringify!(replace_image_index)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_disk_control_callback>())).add_image_index as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_disk_control_callback),
            "::",
            stringify!(add_image_index)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_disk_control_ext_callback {
    pub set_eject_state: retro_set_eject_state_t,
    pub get_eject_state: retro_get_eject_state_t,
    pub get_image_index: retro_get_image_index_t,
    pub set_image_index: retro_set_image_index_t,
    pub get_num_images: retro_get_num_images_t,
    pub replace_image_index: retro_replace_image_index_t,
    pub add_image_index: retro_add_image_index_t,
    pub set_initial_image: retro_set_initial_image_t,
    pub get_image_path: retro_get_image_path_t,
    pub get_image_label: retro_get_image_label_t,
}
#[test]
fn bindgen_test_layout_retro_disk_control_ext_callback() {
    assert_eq!(
        ::std::mem::size_of::<retro_disk_control_ext_callback>(),
        80usize,
        concat!("Size of: ", stringify!(retro_disk_control_ext_callback))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_disk_control_ext_callback>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_disk_control_ext_callback))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_disk_control_ext_callback>())).set_eject_state as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_disk_control_ext_callback),
            "::",
            stringify!(set_eject_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_disk_control_ext_callback>())).get_eject_state as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_disk_control_ext_callback),
            "::",
            stringify!(get_eject_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_disk_control_ext_callback>())).get_image_index as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_disk_control_ext_callback),
            "::",
            stringify!(get_image_index)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_disk_control_ext_callback>())).set_image_index as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_disk_control_ext_callback),
            "::",
            stringify!(set_image_index)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_disk_control_ext_callback>())).get_num_images as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_disk_control_ext_callback),
            "::",
            stringify!(get_num_images)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_disk_control_ext_callback>())).replace_image_index
                as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_disk_control_ext_callback),
            "::",
            stringify!(replace_image_index)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_disk_control_ext_callback>())).add_image_index as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_disk_control_ext_callback),
            "::",
            stringify!(add_image_index)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_disk_control_ext_callback>())).set_initial_image
                as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_disk_control_ext_callback),
            "::",
            stringify!(set_initial_image)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_disk_control_ext_callback>())).get_image_path as *const _
                as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_disk_control_ext_callback),
            "::",
            stringify!(get_image_path)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_disk_control_ext_callback>())).get_image_label as *const _
                as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_disk_control_ext_callback),
            "::",
            stringify!(get_image_label)
        )
    );
}
pub const retro_pixel_format_RETRO_PIXEL_FORMAT_0RGB1555: retro_pixel_format = 0;
pub const retro_pixel_format_RETRO_PIXEL_FORMAT_XRGB8888: retro_pixel_format = 1;
pub const retro_pixel_format_RETRO_PIXEL_FORMAT_RGB565: retro_pixel_format = 2;
pub const retro_pixel_format_RETRO_PIXEL_FORMAT_UNKNOWN: retro_pixel_format = 2147483647;
pub type retro_pixel_format = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_message {
    pub msg: *const ::std::os::raw::c_char,
    pub frames: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_retro_message() {
    assert_eq!(
        ::std::mem::size_of::<retro_message>(),
        16usize,
        concat!("Size of: ", stringify!(retro_message))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_message>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_message))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_message>())).msg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_message),
            "::",
            stringify!(msg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_message>())).frames as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_message),
            "::",
            stringify!(frames)
        )
    );
}
pub const retro_message_target_RETRO_MESSAGE_TARGET_ALL: retro_message_target = 0;
pub const retro_message_target_RETRO_MESSAGE_TARGET_OSD: retro_message_target = 1;
pub const retro_message_target_RETRO_MESSAGE_TARGET_LOG: retro_message_target = 2;
pub type retro_message_target = ::std::os::raw::c_uint;
pub const retro_message_type_RETRO_MESSAGE_TYPE_NOTIFICATION: retro_message_type = 0;
pub const retro_message_type_RETRO_MESSAGE_TYPE_NOTIFICATION_ALT: retro_message_type = 1;
pub const retro_message_type_RETRO_MESSAGE_TYPE_STATUS: retro_message_type = 2;
pub const retro_message_type_RETRO_MESSAGE_TYPE_PROGRESS: retro_message_type = 3;
pub type retro_message_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_message_ext {
    pub msg: *const ::std::os::raw::c_char,
    pub duration: ::std::os::raw::c_uint,
    pub priority: ::std::os::raw::c_uint,
    pub level: retro_log_level,
    pub target: retro_message_target,
    pub type_: retro_message_type,
    pub progress: i8,
}
#[test]
fn bindgen_test_layout_retro_message_ext() {
    assert_eq!(
        ::std::mem::size_of::<retro_message_ext>(),
        32usize,
        concat!("Size of: ", stringify!(retro_message_ext))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_message_ext>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_message_ext))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_message_ext>())).msg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_message_ext),
            "::",
            stringify!(msg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_message_ext>())).duration as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_message_ext),
            "::",
            stringify!(duration)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_message_ext>())).priority as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_message_ext),
            "::",
            stringify!(priority)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_message_ext>())).level as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_message_ext),
            "::",
            stringify!(level)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_message_ext>())).target as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_message_ext),
            "::",
            stringify!(target)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_message_ext>())).type_ as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_message_ext),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_message_ext>())).progress as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_message_ext),
            "::",
            stringify!(progress)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_input_descriptor {
    pub port: ::std::os::raw::c_uint,
    pub device: ::std::os::raw::c_uint,
    pub index: ::std::os::raw::c_uint,
    pub id: ::std::os::raw::c_uint,
    pub description: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_retro_input_descriptor() {
    assert_eq!(
        ::std::mem::size_of::<retro_input_descriptor>(),
        24usize,
        concat!("Size of: ", stringify!(retro_input_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_input_descriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_input_descriptor))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_input_descriptor>())).port as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_input_descriptor),
            "::",
            stringify!(port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_input_descriptor>())).device as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_input_descriptor),
            "::",
            stringify!(device)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_input_descriptor>())).index as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_input_descriptor),
            "::",
            stringify!(index)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_input_descriptor>())).id as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_input_descriptor),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_input_descriptor>())).description as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_input_descriptor),
            "::",
            stringify!(description)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_system_info {
    pub library_name: *const ::std::os::raw::c_char,
    pub library_version: *const ::std::os::raw::c_char,
    pub valid_extensions: *const ::std::os::raw::c_char,
    pub need_fullpath: bool,
    pub block_extract: bool,
}
#[test]
fn bindgen_test_layout_retro_system_info() {
    assert_eq!(
        ::std::mem::size_of::<retro_system_info>(),
        32usize,
        concat!("Size of: ", stringify!(retro_system_info))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_system_info>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_system_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_system_info>())).library_name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_system_info),
            "::",
            stringify!(library_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_system_info>())).library_version as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_system_info),
            "::",
            stringify!(library_version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_system_info>())).valid_extensions as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_system_info),
            "::",
            stringify!(valid_extensions)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_system_info>())).need_fullpath as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_system_info),
            "::",
            stringify!(need_fullpath)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_system_info>())).block_extract as *const _ as usize },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_system_info),
            "::",
            stringify!(block_extract)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_system_content_info_override {
    pub extensions: *const ::std::os::raw::c_char,
    pub need_fullpath: bool,
    pub persistent_data: bool,
}
#[test]
fn bindgen_test_layout_retro_system_content_info_override() {
    assert_eq!(
        ::std::mem::size_of::<retro_system_content_info_override>(),
        16usize,
        concat!("Size of: ", stringify!(retro_system_content_info_override))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_system_content_info_override>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(retro_system_content_info_override)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_system_content_info_override>())).extensions as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_system_content_info_override),
            "::",
            stringify!(extensions)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_system_content_info_override>())).need_fullpath as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_system_content_info_override),
            "::",
            stringify!(need_fullpath)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_system_content_info_override>())).persistent_data
                as *const _ as usize
        },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_system_content_info_override),
            "::",
            stringify!(persistent_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_game_info_ext {
    pub full_path: *const ::std::os::raw::c_char,
    pub archive_path: *const ::std::os::raw::c_char,
    pub archive_file: *const ::std::os::raw::c_char,
    pub dir: *const ::std::os::raw::c_char,
    pub name: *const ::std::os::raw::c_char,
    pub ext: *const ::std::os::raw::c_char,
    pub meta: *const ::std::os::raw::c_char,
    pub data: *const ::std::os::raw::c_void,
    pub size: size_t,
    pub file_in_archive: bool,
    pub persistent_data: bool,
}
#[test]
fn bindgen_test_layout_retro_game_info_ext() {
    assert_eq!(
        ::std::mem::size_of::<retro_game_info_ext>(),
        80usize,
        concat!("Size of: ", stringify!(retro_game_info_ext))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_game_info_ext>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_game_info_ext))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_game_info_ext>())).full_path as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_game_info_ext),
            "::",
            stringify!(full_path)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_game_info_ext>())).archive_path as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_game_info_ext),
            "::",
            stringify!(archive_path)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_game_info_ext>())).archive_file as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_game_info_ext),
            "::",
            stringify!(archive_file)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_game_info_ext>())).dir as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_game_info_ext),
            "::",
            stringify!(dir)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_game_info_ext>())).name as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_game_info_ext),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_game_info_ext>())).ext as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_game_info_ext),
            "::",
            stringify!(ext)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_game_info_ext>())).meta as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_game_info_ext),
            "::",
            stringify!(meta)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_game_info_ext>())).data as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_game_info_ext),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_game_info_ext>())).size as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_game_info_ext),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_game_info_ext>())).file_in_archive as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_game_info_ext),
            "::",
            stringify!(file_in_archive)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_game_info_ext>())).persistent_data as *const _ as usize
        },
        73usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_game_info_ext),
            "::",
            stringify!(persistent_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_game_geometry {
    pub base_width: ::std::os::raw::c_uint,
    pub base_height: ::std::os::raw::c_uint,
    pub max_width: ::std::os::raw::c_uint,
    pub max_height: ::std::os::raw::c_uint,
    pub aspect_ratio: f32,
}
#[test]
fn bindgen_test_layout_retro_game_geometry() {
    assert_eq!(
        ::std::mem::size_of::<retro_game_geometry>(),
        20usize,
        concat!("Size of: ", stringify!(retro_game_geometry))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_game_geometry>(),
        4usize,
        concat!("Alignment of ", stringify!(retro_game_geometry))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_game_geometry>())).base_width as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_game_geometry),
            "::",
            stringify!(base_width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_game_geometry>())).base_height as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_game_geometry),
            "::",
            stringify!(base_height)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_game_geometry>())).max_width as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_game_geometry),
            "::",
            stringify!(max_width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_game_geometry>())).max_height as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_game_geometry),
            "::",
            stringify!(max_height)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_game_geometry>())).aspect_ratio as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_game_geometry),
            "::",
            stringify!(aspect_ratio)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_system_timing {
    pub fps: f64,
    pub sample_rate: f64,
}
#[test]
fn bindgen_test_layout_retro_system_timing() {
    assert_eq!(
        ::std::mem::size_of::<retro_system_timing>(),
        16usize,
        concat!("Size of: ", stringify!(retro_system_timing))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_system_timing>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_system_timing))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_system_timing>())).fps as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_system_timing),
            "::",
            stringify!(fps)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_system_timing>())).sample_rate as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_system_timing),
            "::",
            stringify!(sample_rate)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_system_av_info {
    pub geometry: retro_game_geometry,
    pub timing: retro_system_timing,
}
#[test]
fn bindgen_test_layout_retro_system_av_info() {
    assert_eq!(
        ::std::mem::size_of::<retro_system_av_info>(),
        40usize,
        concat!("Size of: ", stringify!(retro_system_av_info))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_system_av_info>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_system_av_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_system_av_info>())).geometry as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_system_av_info),
            "::",
            stringify!(geometry)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_system_av_info>())).timing as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_system_av_info),
            "::",
            stringify!(timing)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_variable {
    pub key: *const ::std::os::raw::c_char,
    pub value: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_retro_variable() {
    assert_eq!(
        ::std::mem::size_of::<retro_variable>(),
        16usize,
        concat!("Size of: ", stringify!(retro_variable))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_variable>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_variable))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_variable>())).key as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_variable),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_variable>())).value as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_variable),
            "::",
            stringify!(value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_core_option_display {
    pub key: *const ::std::os::raw::c_char,
    pub visible: bool,
}
#[test]
fn bindgen_test_layout_retro_core_option_display() {
    assert_eq!(
        ::std::mem::size_of::<retro_core_option_display>(),
        16usize,
        concat!("Size of: ", stringify!(retro_core_option_display))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_core_option_display>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_core_option_display))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_core_option_display>())).key as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_core_option_display),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_core_option_display>())).visible as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_core_option_display),
            "::",
            stringify!(visible)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_core_option_value {
    pub value: *const ::std::os::raw::c_char,
    pub label: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_retro_core_option_value() {
    assert_eq!(
        ::std::mem::size_of::<retro_core_option_value>(),
        16usize,
        concat!("Size of: ", stringify!(retro_core_option_value))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_core_option_value>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_core_option_value))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_core_option_value>())).value as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_core_option_value),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_core_option_value>())).label as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_core_option_value),
            "::",
            stringify!(label)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_core_option_definition {
    pub key: *const ::std::os::raw::c_char,
    pub desc: *const ::std::os::raw::c_char,
    pub info: *const ::std::os::raw::c_char,
    pub values: [retro_core_option_value; 128usize],
    pub default_value: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_retro_core_option_definition() {
    assert_eq!(
        ::std::mem::size_of::<retro_core_option_definition>(),
        2080usize,
        concat!("Size of: ", stringify!(retro_core_option_definition))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_core_option_definition>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_core_option_definition))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_core_option_definition>())).key as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_core_option_definition),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_core_option_definition>())).desc as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_core_option_definition),
            "::",
            stringify!(desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_core_option_definition>())).info as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_core_option_definition),
            "::",
            stringify!(info)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_core_option_definition>())).values as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_core_option_definition),
            "::",
            stringify!(values)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_core_option_definition>())).default_value as *const _
                as usize
        },
        2072usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_core_option_definition),
            "::",
            stringify!(default_value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_core_options_intl {
    pub us: *mut retro_core_option_definition,
    pub local: *mut retro_core_option_definition,
}
#[test]
fn bindgen_test_layout_retro_core_options_intl() {
    assert_eq!(
        ::std::mem::size_of::<retro_core_options_intl>(),
        16usize,
        concat!("Size of: ", stringify!(retro_core_options_intl))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_core_options_intl>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_core_options_intl))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_core_options_intl>())).us as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_core_options_intl),
            "::",
            stringify!(us)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_core_options_intl>())).local as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_core_options_intl),
            "::",
            stringify!(local)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_core_option_v2_category {
    pub key: *const ::std::os::raw::c_char,
    pub desc: *const ::std::os::raw::c_char,
    pub info: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_retro_core_option_v2_category() {
    assert_eq!(
        ::std::mem::size_of::<retro_core_option_v2_category>(),
        24usize,
        concat!("Size of: ", stringify!(retro_core_option_v2_category))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_core_option_v2_category>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_core_option_v2_category))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_core_option_v2_category>())).key as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_core_option_v2_category),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_core_option_v2_category>())).desc as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_core_option_v2_category),
            "::",
            stringify!(desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_core_option_v2_category>())).info as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_core_option_v2_category),
            "::",
            stringify!(info)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_core_option_v2_definition {
    pub key: *const ::std::os::raw::c_char,
    pub desc: *const ::std::os::raw::c_char,
    pub desc_categorized: *const ::std::os::raw::c_char,
    pub info: *const ::std::os::raw::c_char,
    pub info_categorized: *const ::std::os::raw::c_char,
    pub category_key: *const ::std::os::raw::c_char,
    pub values: [retro_core_option_value; 128usize],
    pub default_value: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_retro_core_option_v2_definition() {
    assert_eq!(
        ::std::mem::size_of::<retro_core_option_v2_definition>(),
        2104usize,
        concat!("Size of: ", stringify!(retro_core_option_v2_definition))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_core_option_v2_definition>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_core_option_v2_definition))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_core_option_v2_definition>())).key as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_core_option_v2_definition),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_core_option_v2_definition>())).desc as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_core_option_v2_definition),
            "::",
            stringify!(desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_core_option_v2_definition>())).desc_categorized as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_core_option_v2_definition),
            "::",
            stringify!(desc_categorized)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_core_option_v2_definition>())).info as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_core_option_v2_definition),
            "::",
            stringify!(info)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_core_option_v2_definition>())).info_categorized as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_core_option_v2_definition),
            "::",
            stringify!(info_categorized)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_core_option_v2_definition>())).category_key as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_core_option_v2_definition),
            "::",
            stringify!(category_key)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_core_option_v2_definition>())).values as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_core_option_v2_definition),
            "::",
            stringify!(values)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_core_option_v2_definition>())).default_value as *const _
                as usize
        },
        2096usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_core_option_v2_definition),
            "::",
            stringify!(default_value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_core_options_v2 {
    pub categories: *mut retro_core_option_v2_category,
    pub definitions: *mut retro_core_option_v2_definition,
}
#[test]
fn bindgen_test_layout_retro_core_options_v2() {
    assert_eq!(
        ::std::mem::size_of::<retro_core_options_v2>(),
        16usize,
        concat!("Size of: ", stringify!(retro_core_options_v2))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_core_options_v2>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_core_options_v2))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_core_options_v2>())).categories as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_core_options_v2),
            "::",
            stringify!(categories)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_core_options_v2>())).definitions as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_core_options_v2),
            "::",
            stringify!(definitions)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_core_options_v2_intl {
    pub us: *mut retro_core_options_v2,
    pub local: *mut retro_core_options_v2,
}
#[test]
fn bindgen_test_layout_retro_core_options_v2_intl() {
    assert_eq!(
        ::std::mem::size_of::<retro_core_options_v2_intl>(),
        16usize,
        concat!("Size of: ", stringify!(retro_core_options_v2_intl))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_core_options_v2_intl>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_core_options_v2_intl))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_core_options_v2_intl>())).us as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_core_options_v2_intl),
            "::",
            stringify!(us)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_core_options_v2_intl>())).local as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_core_options_v2_intl),
            "::",
            stringify!(local)
        )
    );
}
pub type retro_core_options_update_display_callback_t =
    ::std::option::Option<unsafe extern "C" fn() -> bool>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_core_options_update_display_callback {
    pub callback: retro_core_options_update_display_callback_t,
}
#[test]
fn bindgen_test_layout_retro_core_options_update_display_callback() {
    assert_eq!(
        ::std::mem::size_of::<retro_core_options_update_display_callback>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(retro_core_options_update_display_callback)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<retro_core_options_update_display_callback>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(retro_core_options_update_display_callback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_core_options_update_display_callback>())).callback
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_core_options_update_display_callback),
            "::",
            stringify!(callback)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_game_info {
    pub path: *const ::std::os::raw::c_char,
    pub data: *const ::std::os::raw::c_void,
    pub size: size_t,
    pub meta: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_retro_game_info() {
    assert_eq!(
        ::std::mem::size_of::<retro_game_info>(),
        32usize,
        concat!("Size of: ", stringify!(retro_game_info))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_game_info>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_game_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_game_info>())).path as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_game_info),
            "::",
            stringify!(path)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_game_info>())).data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_game_info),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_game_info>())).size as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_game_info),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_game_info>())).meta as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_game_info),
            "::",
            stringify!(meta)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_framebuffer {
    pub data: *mut ::std::os::raw::c_void,
    pub width: ::std::os::raw::c_uint,
    pub height: ::std::os::raw::c_uint,
    pub pitch: size_t,
    pub format: retro_pixel_format,
    pub access_flags: ::std::os::raw::c_uint,
    pub memory_flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_retro_framebuffer() {
    assert_eq!(
        ::std::mem::size_of::<retro_framebuffer>(),
        40usize,
        concat!("Size of: ", stringify!(retro_framebuffer))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_framebuffer>(),
        8usize,
        concat!("Alignment of ", stringify!(retro_framebuffer))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_framebuffer>())).data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_framebuffer),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_framebuffer>())).width as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_framebuffer),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_framebuffer>())).height as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_framebuffer),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_framebuffer>())).pitch as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_framebuffer),
            "::",
            stringify!(pitch)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_framebuffer>())).format as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_framebuffer),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_framebuffer>())).access_flags as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_framebuffer),
            "::",
            stringify!(access_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<retro_framebuffer>())).memory_flags as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_framebuffer),
            "::",
            stringify!(memory_flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_fastforwarding_override {
    pub ratio: f32,
    pub fastforward: bool,
    pub notification: bool,
    pub inhibit_toggle: bool,
}
#[test]
fn bindgen_test_layout_retro_fastforwarding_override() {
    assert_eq!(
        ::std::mem::size_of::<retro_fastforwarding_override>(),
        8usize,
        concat!("Size of: ", stringify!(retro_fastforwarding_override))
    );
    assert_eq!(
        ::std::mem::align_of::<retro_fastforwarding_override>(),
        4usize,
        concat!("Alignment of ", stringify!(retro_fastforwarding_override))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_fastforwarding_override>())).ratio as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_fastforwarding_override),
            "::",
            stringify!(ratio)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_fastforwarding_override>())).fastforward as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_fastforwarding_override),
            "::",
            stringify!(fastforward)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_fastforwarding_override>())).notification as *const _
                as usize
        },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_fastforwarding_override),
            "::",
            stringify!(notification)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<retro_fastforwarding_override>())).inhibit_toggle as *const _
                as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(retro_fastforwarding_override),
            "::",
            stringify!(inhibit_toggle)
        )
    );
}
pub type retro_environment_t = ::std::option::Option<
    unsafe extern "C" fn(cmd: ::std::os::raw::c_uint, data: *mut ::std::os::raw::c_void) -> bool,
>;
pub type retro_video_refresh_t = ::std::option::Option<
    unsafe extern "C" fn(
        data: *const ::std::os::raw::c_void,
        width: ::std::os::raw::c_uint,
        height: ::std::os::raw::c_uint,
        pitch: size_t,
    ),
>;
pub type retro_audio_sample_t = ::std::option::Option<unsafe extern "C" fn(left: i16, right: i16)>;
pub type retro_audio_sample_batch_t =
    ::std::option::Option<unsafe extern "C" fn(data: *const i16, frames: size_t) -> size_t>;
pub type retro_input_poll_t = ::std::option::Option<unsafe extern "C" fn()>;
pub type retro_input_state_t = ::std::option::Option<
    unsafe extern "C" fn(
        port: ::std::os::raw::c_uint,
